app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    all_restaurants = Restaurant.all